announcements/search-gmail-gnus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Searching GMail Using IMap and GNUS</title>
<!-- 2014-02-08 Sat 16:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Searching GMail Using IMap and GNUS</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Searching GMail Using IMap and GNUS</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs package GNUS provides a very efficient interface for
consuming large amounts of email.
You can access GMail using GNUS' IMap interface, for my own
configuration for doing this, see file <span class="underline">tvr/gnus-prepare.el</span> in
the Emacspeak SVN  repository.
Module <span class="underline">gm-nnir.el</span>  in package <span class="underline">g-client</span> implements some
convenience hooks to enable efficient searching of GMail. Module
<span class="underline">emacspeak-gnus</span> has been updated to bind commands from module
<span class="underline">gm-nnir.el</span> to <span class="underline">?</span> and <span class="underline">/</span> in  the <b>Group</b> buffer.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Basic Usage</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Assuming you already have GNUS configured to read GMail via IMap,
you can:
</p>

<ul class="org-ul">
<li>Press <span class="underline">/</span> in the  groups buffer  to search your mail. This
command accepts all GMail queries, so for example,
</li>
</ul>
<pre class="example">
after: 2014/02/01 to: me
</pre>
<p>
Will find all messages received after   February 1, 2014 and
addressed to you.
</p>
<pre class="example">
label: foo after: 2014/01/01
</pre>
<p>
Will find messages with label <span class="underline">foo</span> and received after January
1, 2014.
</p>
<ul class="org-ul">
<li>Press <span class="underline">?</span> in the Group buffer to execute a more extensive
search command; this accepts both IMap query specifications
(per RFC 3501) as well as GMail query specifications. The
command provides smart completion, follow the prompts  to
build up complex queries. In general, there is almost
nothing you cannot do with the GMail query language, so this
command is mostly there as a backup.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> The Technical Details</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The GMail query language is exposed to IMap via custom search key
<span class="underline">X-GM-RAW</span>; commands <span class="underline">gm-nnir-group-make-gmail-group</span> and
<span class="underline">gm-nnir-group-make-nnir-group</span> use this functionality to
construct <i>ephemeral</i> groups that hold the search results.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-02-08 Sat&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2014-02-08 Sat 16:57</p>
<p class="creator">Emacs 24.3.50.2 (Org mode 8.2.5c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
